# -*- coding: utf-8 -*-

######################################################################################################################

# Список доступных валют
currency = {
    'AED': 'Дирхам ОАЭ',
    'AMD': 'Армянский драм',
    'AUD': 'Австралийский доллар',
    'AZN': 'Азербайджанский манат',
    'BGN': 'Болгарский лев',
    'BYN': 'Белорусский рубль',
    'CAD': 'Канадский доллар',
    'CHF': 'Швейцарский франк',
    'CNY': 'Китайский юань',
    'EUR': 'Евро',
    'GBP': 'Фунт стерлингов Соединенного королевства',
    'GEL': 'Грузинский лари',
    'IDR': 'Индонезийская рупия',
    'JPY': 'Японская иена',
    'KGS': 'Киргизский сом',
    'KZT': 'Казахстанский тенге',
    'MDL': 'Молдавский лей',
    'NZD': 'Новозеландский доллар',
    'RSD': 'Сербский динар',
    'RUB': 'Российский рубль',
    'SGD': 'Сингапурский доллар',
    'THB': 'Таиландский бат',
    'TRY': 'Турецкая лира',
    'UAH': 'Украинская гривна',
    'USD': 'Доллар США',
    'VND': 'Вьетнамский донг'
}

# Адрес сайта для запроса курса валют
api_url = 'https://currate.ru/api/'

# Текст кнопки помощи
help_command = 'Помощь'

# Текст кнопки со списком валют
values_command = 'Доступные валюты'

# Текст подсказки
help_text = 'Чтобы узнать стоимость, введите команду в следующем формате:\n' \
            '<имя валюты цену которой нужно узнать> <имя валюты в которой надо узнать цену> <количество валюты>\n' \
            'Информацию о доступных валютах можно узнать командой: /values\n' \
            'А помощь командой: /help'


######################################################################################################################
